1.get the powers of an array values element-wise.

In [3]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({'X':[1, 2, 3, 4], 'Y':[2, 3, 2, 1],'Z':[3, 1, 2, 1]})
df2 = pd.DataFrame(np.random.randint(1,3, size = (4, 3)))

In [4]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [5]:
display('df1', 'df2', 'pd.DataFrame(df1.values ** df2.values)') # turn df to nparray when requires elementwise computation

df1
   X  Y  Z
0  1  2  3
1  2  3  1
2  3  2  2
3  4  1  1

df2
   0  1  2
0  1  1  2
1  1  1  1
2  1  1  1
3  1  2  1

pd.DataFrame(df1.values ** df2.values)
   0  1  2
0  1  2  9
1  2  3  1
2  3  2  2
3  4  1  1

2. from dict to DataFrame

In [6]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

3.  display a summary of the basic information about a specified DataFrame and its data

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

4. first three rows

In [22]:
df.iloc[:3, ]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

5. column selection

In [28]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [32]:
df.loc[:, ['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

6. row and column combination selection

In [34]:
df.iloc[[1, 3, 5, 6], [1, 3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

7. select the rows where the number of attempts in the examination is greater than 2.

In [11]:
df[df['attempts']>2] # a single mask column will be used in filtering

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

8. count the number of rows and columns of a DataFrame

In [12]:
df.shape # df.columns df.index

(10, 4)

9. select the rows where the score is missing, i.e. is NaN

In [54]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index = labels)
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

10. select rows  the score is between 15 and 20 (inclusive).

In [31]:
df[(df['score']>=15).values & (df['score']<=20).values]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [32]:
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

11. number of attempts in the examination is less than 2 and score greater than 15.

In [33]:
df[(df['attempts'] < 3) & (df['score'] > 15)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes

12. change the score in row 'd' to 11.5.

In [34]:
df.loc['d', 'score'] = 11.5

13. sum of the examination attempts by the students.

In [35]:
df['attempts'].sum()

19

14. calculate the mean score for each different student in data frame.

In [38]:
df['score'].mean()

13.333333333333334

15. add a new row

In [43]:
df.loc['k'] = ['Lucy', 20, 1, 'yes']

In [44]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k       Lucy   20.0         1     yes

In [45]:
df.drop(['a', 'k'])

        name  score  attempts qualify
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

16. sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [46]:
df.sort_values(by = ['name', 'score'], ascending = [False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
k       Lucy   20.0         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

17. replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [47]:
df['qualify'] = df['qualify'].map({'yes':True, 'no':False}) ## using a dict to change the factor values

In [48]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k       Lucy   20.0         1     True

18. change the name 'James' to 'Suresh' in name column of the DataFrame.

In [55]:
df['name'] = df['name'].replace({'James': 'Suresh'}, {'Dima':'Lucy'})

In [57]:
df['qualify'] = df['qualify'].replace({'yes':True, 'no':False})

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 330.0+ bytes

19. delete the 'attempts' column from the DataFrame

In [66]:
df.pop('attempts') # drop rows and pop columns

20. insert a new column in existing DataFrame

In [69]:
df['newcol'] = list(range(len(df.index)))

21.  iterate over rows in a DataFrame

In [72]:
for index, row in df.iterrows():
    print(index, row['name'], row['score'])

a Anastasia 12.5
b Dima 9.0
c Katherine 16.5
d James nan
e Emily 9.0
f Michael 20.0
g Matthew 14.5
h Laura nan
i Kevin 8.0
j Jonas 19.0

22.  get list from DataFrame column headers

In [75]:
list(df.columns.values)

['name', 'score', 'qualify', 'newcol']

23. rename columns of a given DataFrame

In [76]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df.columns = ['Column1', 'Column2', 'Column3']
df = df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [77]:
df

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

24. select rows

In [80]:
df[df['Column1'] == 4]

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

25.  change the order of a DataFrame columns.

In [83]:
df[['Column3', 'Column2', 'Column1']]

   Column3  Column2  Column1
0        7        4        1
1        8        5        2
2        9        6        3

26. add row

In [84]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df2 = {'col1': 10, 'col2': 11, 'col3': 12}
df.append(df2, ignore_index=True)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

27. write a DataFrame to CSV file using tab separator.

In [ ]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print('Data from new_file.csv file:')
df.to_csv('new_file.csv', sep='\t', index=False)
new_df = pd.read_csv('new_file.csv')

28. count city wise number of people from a given of data set

In [91]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df1.groupby(["city"]).size().reset_index(name='Number of people')

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

29. delete DataFrame row(s) based on given column value

In [96]:
df[df.col1 != 1]

   col1  col2  col3
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

30. widen output display to see more columns

In [103]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

31. select a row of series/dataframe by given integer index

In [110]:
df.iloc[[2, 3], [1,2]] # the second row

   col2  col3
2     6     9
3     7     0

32.  replace all the NaN values with Zero's in a column of a dataframe

In [124]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

In [114]:
df.fillna(0)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

33. convert index in a column of the given dataframe

In [125]:
df.reset_index(level=0, inplace=True)
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

34. set a given value for particular cell in  DataFrame using index value.

In [127]:
df.set_value(8, 'score', 10.2)
df

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin   10.2         2      no
9      9      Jonas   19.0         1     yes

In [128]:
df.loc[9, 'attempts']=10

In [129]:
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin   10.2         2      no
9      9      Jonas   19.0        10     yes

35. count the NaN values in one or more columns in DataFrame.

In [131]:
df.isnull().sum()

index       0
name        0
score       2
attempts    0
qualify     0
dtype: int64

36. drop list of rows

In [132]:
df.drop([0,2, 4])

   index     name  score  attempts qualify
1      1     Dima    9.0         3      no
3      3    James    NaN         3      no
5      5  Michael   20.0         3     yes
6      6  Matthew   14.5         1     yes
7      7    Laura    NaN         1      no
8      8    Kevin   10.2         2      no
9      9    Jonas   19.0        10     yes

37. reset index in a given DataFrame

In [139]:
df = df.drop(range(5))
df

In [143]:
df.reset_index() # change to default counting index and add a column

   level_0  index     name  score  attempts qualify
0        5      5  Michael   20.0         3     yes
1        6      6  Matthew   14.5         1     yes
2        7      7    Laura    NaN         1      no
3        8      8    Kevin   10.2         2      no
4        9      9    Jonas   19.0        10     yes

In [152]:
# df.pop('level_0')
df.pop('index')

5    5
6    6
7    7
8    8
9    9
Name: index, dtype: int64

In [153]:
df

      name  score  attempts qualify
5  Michael   20.0         3     yes
6  Matthew   14.5         1     yes
7    Laura    NaN         1      no
8    Kevin   10.2         2      no
9    Jonas   19.0        10     yes

38. devide a DataFrame in a given ratio

In [157]:
df = pd.DataFrame(np.random.randint(10, size = (10, 3)))
df

   0  1  2
0  6  6  4
1  4  2  8
2  0  0  1
3  5  8  4
4  8  9  7
5  1  0  2
6  9  2  5
7  6  0  9
8  6  4  5
9  5  9  5

In [158]:
part_70 = df.sample(frac=0.7,random_state=10) ## could be useful to test the performance
part_30 = df.drop(part_70.index)
display('part_70', 'part_30')

part_70
   0  1  2
8  6  4  5
2  0  0  1
5  1  0  2
6  9  2  5
3  5  8  4
1  4  2  8
0  6  6  4

part_30
   0  1  2
4  8  9  7
7  6  0  9
9  5  9  5

39. combine two series

In [177]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])

In [179]:
pd.concat([s1, s2], axis=0) # axis = 1 becomes a DF

0       100
1       200
2    python
3    300.12
4       400
0        10
1        20
2       php
3     30.12
4        40
dtype: object

40. shuffle a dataframe rows

In [180]:
df

   0  1  2
0  6  6  4
1  4  2  8
2  0  0  1
3  5  8  4
4  8  9  7
5  1  0  2
6  9  2  5
7  6  0  9
8  6  4  5
9  5  9  5

41.convert DataFrame column type from string to datetime.

In [181]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

In [182]:
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [183]:
df = df.sample(frac=1) # the same with CV cut

42. convert DataFrame column type from string to datetime.

In [184]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
pd.to_datetime(s)

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

43. turn a column to a list

In [186]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [187]:
df['col2']

0    4
1    5
2    6
Name: col2, dtype: int64

In [188]:
df["col2"].tolist()

[4, 5, 6]

44. create a DataFrame from a Numpy array

In [190]:
dtype = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')]
values = np.zeros(15, dtype=dtype)

In [191]:
values

array([(0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.),
       (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.),
       (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.)],
      dtype=[('Column1', '<i4'), ('Column2', '<f4'), ('Column3', '<f4')])

In [193]:
index = ['Index'+str(i) for i in range(1, len(values)+1)]
df = pd.DataFrame(values, index=index)
df

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

45. find the row for where the value of a given column is maximum

In [198]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df['col1'].idxmax()

4

In [202]:
ss = pd.Series(range(10))

In [204]:
ss.idxmax()

9

46. whether a given column is present in a DataFrame or not.

In [208]:
'col1' in df.columns

True

47. specified row value of a given DataFrame

48. get column datatype

In [210]:
df.dtypes

col1    int64
col2    int64
col3    int64
dtype: object

49. append data to an empty DataFrame

In [212]:
df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
print("After appending some data:")
df.append(data)

After appending some data:

   col1  col2
0     0     0
1     1     1
2     2     2

50. sort a given DataFrame by two or more column

In [213]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df.sort_values(['attempts', 'name'], ascending=[True, True])

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

51.  convert the datatype of a given column

In [217]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9.1, 16.5, 12.77, 9.21, 20.22, 14.5, 11.34, 8.8, 19.13],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df.score = df.score.astype(int, errors = 'ignore')

In [223]:
df.dtypes

name        object
score        int64
attempts     int64
qualify     object
dtype: object

52. remove infinite values from a given DataFrame

In [224]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df)
print("Removing infinite values:")
df.replace([np.inf, -np.inf], np.nan)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
Removing infinite values:

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

53. insert column at specific position

In [226]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
new_col = [1, 2, 3, 4, 7]  
# insert the said column at the beginning in the DataFrame
idx = 0
df.insert(loc=idx, column='col1', value=new_col)
df

Original DataFrame
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

54

55. group by the first column and get second column as lists in rows

In [249]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
print(df)
df.groupby('col1')['col2'].apply(list)

Original DataFrame
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

56. get column index from column name of a given DataFrame.

In [250]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nIndex of 'col2'")
print(df.columns.get_loc("col2"))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Index of 'col2'
1

58. select other column

In [252]:
df.loc[:, df.columns != 'col3']

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

61. get topmost n records within each group of a DataFrame.

In [253]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\ntopmost n records within each group of a DataFrame:")
df.nlargest(3, 'col1')

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

topmost n records within each group of a DataFrame:

   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11